In [1]:
import pandas as pd

In [2]:
import seaborn as sns
df= sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.shape

(891, 15)

In [4]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

#### 1. Count the number of unique values in the 'Pclass' column of the Titanic dataset.

In [5]:
df.pclass.value_counts()

pclass
3    491
1    216
2    184
Name: count, dtype: int64

#### 2.Filter rows where passengers are above 50 years old from the Titanic dataset.

In [6]:
df[df['age']>50].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
33,0,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False

#### 3. Sort the Titanic dataset by 'Age' in descending order and display the top 5 rows.

In [7]:
df.sort_values(by='age',ascending=False).head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

#### 4. Find the mean 'Fare' for each 'Pclass' in the Titanic dataset.

In [8]:
df.groupby(by='pclass')['fare'].mean()

pclass
1    84.154687
2    20.662183
3    13.675550
Name: fare, dtype: float64

#### 5. Calculate the average 'Age' of passengers by 'Embarked' location in the Titanic dataset.

In [9]:
df.groupby(by='embarked')['age'].mean()

embarked
C    30.814769
Q    28.089286
S    29.445397
Name: age, dtype: float64

#### 6. Get the count of survivors for each 'Pclass' and 'Sex' in the Titanic dataset.

In [10]:
survivors = df[df['survived'] == 1]
survivor_counts = survivors.groupby(['sex', 'pclass'])['survived'].count().unstack()
survivor_counts

pclass   1   2   3
sex
female  91  70  72
male    45  17  47

#### 7.In the Titanic dataset, calculate the mean 'Fare' and 'Age' for each combination of 'Sex' and 'Pclass'.

In [11]:
df.groupby(by=['sex','pclass'])[['fare','age']].mean()

                     fare        age
sex    pclass
female 1       106.125798  34.611765
       2        21.970121  28.722973
       3        16.118810  21.750000
male   1        67.226127  41.281386
       2        19.741782  30.740707
       3        12.661633  26.507589

#### 8. In the Titanic dataset, find the maximum 'Fare' paid by each 'Embarked' location.

In [12]:
df.groupby(by=['embarked'])['fare'].max()

embarked
C    512.3292
Q     90.0000
S    263.0000
Name: fare, dtype: float64

#### 9. In the Tips dataset, calculate the total and average 'tip' for each 'day'.

In [13]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [15]:
tips_df = sns.load_dataset('tips')
tips_df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [24]:
tips_df.groupby(by='day',observed=True)['tip'].agg(['sum','mean']).rename(columns={'sum':'sum of','mean':'mean of'})

      sum of   mean of
day
Thur  171.83  2.771452
Fri    51.96  2.734737
Sat   260.40  2.993103
Sun   247.39  3.255132

#### 10. For each 'sex' in the Tips dataset, find the minimum, maximum, and average 'total_bill'.

In [26]:
tips_df.groupby(by='sex',observed=False)['total_bill'].agg(['min','max','mean']).rename(columns={'min':'minimum bill','max':'max bill','mean':'average bill'})

        minimum bill  max bill  average bill
sex
Male            7.25     50.81     20.744076
Female          3.07     44.30     18.056897

#### 11. Group the Tips dataset by 'time' and calculate the mean and median 'tip' for each group.

In [28]:
tips_df.groupby(by='time',observed=False)['tip'].agg(['mean','median'])

            mean  median
time
Lunch   2.728088    2.25
Dinner  3.102670    3.00

#### 12.In the Iris dataset, find the average 'petal_length' for each species.

In [29]:
iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [30]:
iris.groupby(by='species')['petal_length'].agg(['mean'])

             mean
species
setosa      1.462
versicolor  4.260
virginica   5.552

#### 13. Using the Titanic dataset, create a pivot table to display the mean 'Age' for each combination of 'Pclass' and 'Sex'.

In [33]:
pd.pivot_table(data=df,values='age',index='pclass',columns='sex',aggfunc='mean')

sex        female       male
pclass
1       34.611765  41.281386
2       28.722973  30.740707
3       21.750000  26.507589

#### 14. In the Tips dataset, create a pivot table to show the sum of 'total_bill' for each 'day' and 'time'.

In [38]:
pd.pivot_table(values='total_bill',data=tips_df,index='day',columns='time',aggfunc='sum')

time    Lunch   Dinner
day
Thur  1077.55    18.78
Fri     89.92   235.96
Sat      0.00  1778.40
Sun      0.00  1627.16

#### 15. In the Titanic dataset, create a pivot table that shows the count of passengers based on 'Pclass' and 'Embarked'.

In [40]:
pd.pivot_table(df,values='survived',index='pclass',columns='embarked',aggfunc='count')

embarked   C   Q    S
pclass
1         85   2  127
2         17   3  164
3         66  72  353

#### 16. In the Titanic dataset, create a pivot table to find the minimum, maximum, and average 'Age' for each 'Pclass'.

In [41]:
pd.pivot_table(df,values='age',index='pclass',aggfunc=['mean','max','min'])

             mean   max   min
              age   age   age
pclass
1       38.233441  80.0  0.92
2       29.877630  70.0  0.67
3       25.140620  74.0  0.42

#### 17. Create a pivot table using the Tips dataset to show both the count and mean of 'total_bill' by 'time' and 'day'.

In [44]:
pd.pivot_table(tips_df,values='total_bill',index='day',columns='time',aggfunc=['mean','count'],dropna=True)

           mean            count
time      Lunch     Dinner Lunch Dinner
day
Thur  17.664754  18.780000    61      1
Fri   12.845714  19.663333     7     12
Sat         NaN  20.441379     0     87
Sun         NaN  21.410000     0     76

#### 18. In the Titanic dataset, create a pivot table to show the sum of 'Fare' for each 'Pclass' by 'Embarked', and fill missing values with 0.

In [45]:
pd.pivot_table(df,values='fare',index='pclass',columns='embarked',aggfunc='sum')

embarked          C         Q          S
pclass
1         8901.0750  180.0000  8936.3375
2          431.0917   37.0500  3333.7000
3          740.1295  805.2043  5169.3613

#### 19.Using the Titanic dataset, create a crosstab to count passengers by 'Pclass' and 'Sex'.

In [49]:
pd.crosstab(df['pclass'],df['sex'])

sex     female  male
pclass
1           94   122
2           76   108
3          144   347

#### 20. In the Titanic dataset, create a crosstab to show survival counts for each 'Pclass'.

In [50]:
pd.crosstab(df['survived'],df['pclass'])

pclass      1   2    3
survived
0          80  97  372
1         136  87  119

#### 21. Using the Tips dataset, create a crosstab to count occurrences for each 'day' and 'sex'.

In [51]:
pd.crosstab(tips_df['day'],tips_df['sex'])

sex   Male  Female
day
Thur    30      32
Fri     10       9
Sat     59      28
Sun     58      18

#### 22.Using the Tips dataset, create a crosstab with the total 'total_bill' amount for each 'day' and 'time'.

In [56]:
pd.crosstab(tips_df['time'],tips_df['day'],values=tips_df['total_bill'],aggfunc='sum')

day        Thur     Fri     Sat      Sun
time
Lunch   1077.55   89.92     0.0     0.00
Dinner    18.78  235.96  1778.4  1627.16

#### 23. In the Titanic dataset, create a crosstab to show the count of passengers for each 'Pclass' by 'Age' bins (e.g., 0-10, 11-20, etc.).

In [60]:
df['Age_Bin'] = pd.cut(df['age'], bins=[0, 10, 20, 30, 40, 50, 60, 70, 80])
pd.crosstab(df['pclass'],df['Age_Bin'])

Age_Bin,"(0, 10]","(10, 20]","(20, 30]","(30, 40]","(40, 50]","(50, 60]","(60, 70]","(70, 80]"
pclass,,,,,,,,
1,3,18,40,49,37,25,11,3
2,17,18,61,43,19,12,3,0
3,44,79,129,63,30,5,3,2

#### 24. In the Titanic dataset, create a crosstab to display the mean 'Fare' for each 'Embarked' location and 'Sex'.

In [62]:
pd.crosstab(df['embarked'],df['sex'],values=df['fare'],aggfunc='mean')

sex          female       male
embarked
C         75.169805  48.262109
Q         12.634958  13.838922
S         38.740929  21.711996

#### 25. Using the Titanic dataset, create a crosstab to show survival counts for each 'Pclass' and 'Sex', and apply a lambda function to find the percentage.

In [63]:
pd.crosstab(df['pclass'],df['sex'],values=df['survived'],aggfunc='count')

sex     female  male
pclass
1           94   122
2           76   108
3          144   347

In [70]:
import pandas as pd

# Dataset 1: Employees
employees_data = {
    "Emp_ID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119],
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Grace", "Heidi", "Ivan", "Jack", "Kelly", "Leo", 
             "Mallory", "Nathan", "Olivia", "Peggy", "Quinn", "Ruth", "Steve"],
    "Department": ["HR", "IT", "IT", "HR", "Marketing", "IT", "Marketing", "IT", "HR", "Marketing", "HR", 
                   "Marketing", "IT", "Marketing", "IT", "HR", "IT", "Marketing", "IT"],
    "Salary": [50000, 60000, 65000, 52000, 48000, 70000, 47000, 71000, 51000, 46000, 53000, 49000, 67000, 44000, 
               72000, 55000, 63000, 48000, 66000]
}

# Dataset 2: Departments
departments_data = {
    "Dept_ID": list(range(1, 21)),
    "Department": ["HR", "IT", "Marketing", "HR", "IT", "Marketing", "HR", "IT", "Marketing", "IT", "HR", 
                   "Marketing", "IT", "Marketing", "HR", "IT", "Marketing", "HR", "IT", "Marketing"],
    "Location": ["New York", "San Francisco", "Chicago", "Boston", "Los Angeles", "Seattle", "Atlanta", 
                 "San Jose", "Miami", "Dallas", "Phoenix", "Denver", "Austin", "Tampa", "Los Angeles", 
                 "New York", "Dallas", "Seattle", "Chicago", "San Francisco"]
}

# Create DataFrames
df_employees = pd.DataFrame(employees_data)
df_departments = pd.DataFrame(departments_data)

#### 26. Merge the df_employees and df_departments dataframes based on the Department column. Only include rows that have matching values in both dataframes.

In [76]:
df_employees.merge(df_departments,on='Department',how='inner').head(3)

   Emp_ID   Name Department  Salary  Dept_ID  Location
0     101  Alice         HR   50000        1  New York
1     101  Alice         HR   50000        4    Boston
2     101  Alice         HR   50000        7   Atlanta

#### 27. Perform a left join between df_employees and df_departments, keeping all rows from the df_employees dataframe, and add matching rows from df_departments based on the Department column.

In [102]:
df_employees.merge(df_departments,how='left',on='Department').head()

   Emp_ID   Name Department  Salary  Dept_ID     Location
0     101  Alice         HR   50000        1     New York
1     101  Alice         HR   50000        4       Boston
2     101  Alice         HR   50000        7      Atlanta
3     101  Alice         HR   50000       11      Phoenix
4     101  Alice         HR   50000       15  Los Angeles

#### 28.Perform an inner join between the employees and departments datasets on the Department column. Display the result and identify employees who are working in the locations listed in the departments dataset.

In [104]:
df_employees.merge(df_departments,how='inner',on='Department').head()

   Emp_ID   Name Department  Salary  Dept_ID     Location
0     101  Alice         HR   50000        1     New York
1     101  Alice         HR   50000        4       Boston
2     101  Alice         HR   50000        7      Atlanta
3     101  Alice         HR   50000       11      Phoenix
4     101  Alice         HR   50000       15  Los Angeles

#### 29. Merge the datasets to find employees whose department has a location in "New York" or "San Francisco". Display their names and salaries.

In [118]:
x=df_employees.merge(df_departments,how='inner',on='Department')
x[(x['Location'] == 'New York') | (x['Location'] == 'San Francisco')].head(2)

   Emp_ID   Name Department  Salary  Dept_ID  Location
0     101  Alice         HR   50000        1  New York
6     104  David         HR   52000        1  New York

#### 30. Merge the datasets and filter the result to display only employees with a salary greater than 60,000 who are located in "IT" departments.

In [120]:
merged_df = df_employees.merge(df_departments, on='Department')
merged_df[(merged_df['Salary'] > 60000) & (merged_df['Department'] == 'IT')].head()

    Emp_ID     Name Department  Salary  Dept_ID       Location
37     103  Charlie         IT   65000        2  San Francisco
38     103  Charlie         IT   65000        5    Los Angeles
39     103  Charlie         IT   65000        8       San Jose
40     103  Charlie         IT   65000       10         Dallas
41     103  Charlie         IT   65000       13         Austin